app/controllers/apis_controller.rb

  def show
    api = Api.find(params[:id])
---
SELECT  "apis".* FROM "apis"  WHERE "apis"."id" = $1 LIMIT 1  [["id", 12]]