app/controllers/apis_controller.rb

  def create
    ## might need to changed parameters we are passing in
    new_api = Api.new(params[:api])
    if new_api.save
---
INSERT INTO "apis" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2014-09-10 19:04:37.185389"], ["updated_at", "2014-09-10 19:04:37.185389"]]