app/controllers/reviews_controller.rb

  def index
    if params[:api_id]
      api = Api.find(params[:api_id])
      reviews = []
      api.reviews.each do |rev|
        review = {}
        review["rev"] = rev
        review["votes"] = rev.votes
        review["comments"] = rev.comments
        review["user"] = rev.user
        reviews << review
      end
      reviews.sort_by!{|rev_obj| rev_obj["votes"].count}
      reviews.reverse!
      render json: {reviews: reviews}.to_json
    elsif params[:user_id]
        user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]