app/controllers/reviews_controller.rb

  def index
    if params[:api_id]
      api = Api.find(params[:api_id])
      reviews = []
      api.reviews.each do |rev|
---
SELECT  "apis".* FROM "apis"  WHERE "apis"."id" = $1 LIMIT 1  [["id", 12]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."api_id" = $1  [["api_id", 12]]

  def create
    api = Api.find(params[:api_id])
    user = User.find(params[:user_id])
    review = Review.new(score: params[:score], title: params[:title], content: params[:content])
    if review.save
---
SELECT  "apis".* FROM "apis"  WHERE "apis"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "reviews" ("api_id", "content", "created_at", "score", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["api_id", 4], ["content", "you are an api"], ["created_at", "2014-09-09 22:55:55.964312"], ["score", 3], ["title", "i love this api"], ["updated_at", "2014-09-09 22:55:55.964312"]]