app/controllers/search_controller.rb

  def search
    pg_apis = PgSearch.multisearch(params[:input])
    if !(pg_apis.empty?)
      apis = []
      pg_apis.each do |api|
        api_db = Api.find(api.id)
        average_score = api_db.average_score
        api_hash = {id: api_db.id, title: api_db.title, description: api_db.description,
                    tips: api_db.tips, logo_url: api_db.logo_url, average_score: average_score, review_count: api_db.reviews.count}
---
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."api_id" = $1  [["api_id", 4]]