app/controllers/search_controller.rb

  def search
    pg_apis = PgSearch.multisearch(params[:input])
    if !(pg_apis.empty?)
      apis = []
      pg_apis.each do |api|
        api_db = Api.find(api.id)
---
SELECT  "apis".* FROM "apis"  WHERE "apis"."id" = $1 LIMIT 1  [["id", 12]]