app/controllers/users_controller.rb

  def create
    @user = User.new(email: params[:email], username: params[:username])
    @user.password = params[:password]
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_hash", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"