app/controllers/votes_controller.rb

  def create
    review = Review.find(params[:review_id])
    new_vote = review.votes.new()
    user = User.find(params[:user_id])
    puts "status #{user.votes.where("id = ?", new_vote.id).first}"
    if (user.votes.where("review_id = ?", new_vote.review_id).first).nil? && new_vote.save
      vote_count = review.votes.count
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = $1 LIMIT 1  [["id", 39]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 21]]
SELECT  "votes".* FROM "votes"  WHERE "votes"."user_id" = $1 AND (review_id = 39)  ORDER BY "votes"."id" ASC LIMIT 1  [["user_id", 21]]
INSERT INTO "votes" ("created_at", "review_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-09-09 22:55:09.953237"], ["review_id", 39], ["updated_at", "2014-09-09 22:55:09.953237"]]
UPDATE "votes" SET "updated_at" = $1, "user_id" = $2 WHERE "votes"."id" = 101  [["updated_at", "2014-09-09 22:55:09.965196"], ["user_id", 21]]
SELECT COUNT(*) FROM "votes"  WHERE "votes"."review_id" = $1  [["review_id", 39]]