app/controllers/votes_controller.rb

  def index
    votes = Review.find(params[:review_id]).votes
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "votes".* FROM "votes"  WHERE "votes"."review_id" = $1  [["review_id", 3]]